Revit 2026 API

# AssetPropertyAddCopyAsConnectedAsset Method

---

Makes a copy of the asset and connects it to this property.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddCopyAsConnectedAsset(
	Asset pRenderingAsset
)
```
```vb
Public Sub AddCopyAsConnectedAsset (
	pRenderingAsset As Asset
)
```
```cpp
public:
void AddCopyAsConnectedAsset(
	Asset^ pRenderingAsset
)
```
```fsharp
member AddCopyAsConnectedAsset :
        pRenderingAsset : Asset -> unit
```

#### Parameters

pRenderingAsset Asset
     The asset to duplicate and associate with this property as a connected asset.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The asset property is not editable. -or- Cannot check validity for a property not being edited in AppearanceAssetEditScope. -or- Asset property is already connected to one asset. |

#### Reference

AssetProperty Class

Autodesk.Revit.DB.Visual Namespace